In [11]:
import pandas as pd
import seaborn as sns

df = pd.read_csv('../data/occupations.csv')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

#### 1. 여성이 가장 많이 종사하고 있는 직종, 상위 3개

In [9]:
# 여성 데이터만 추출
women = df[df['gender'] == 'F']
# 직종별 카운트 한 후 내림차순 정렬
women['occupation'].value_counts().sort_values(ascending=False)

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

#### 2. 남성이 가장 많이 종사하고 있는 직종, 상위 3개

In [12]:
# 남성 데이터 추출
men = df[df['gender'] == 'M']
men['occupation'].value_counts().sort_values(ascending=False)

occupation
student          136
other             69
educator          69
engineer          65
programmer        60
administrator     43
executive         29
scientist         28
technician        26
writer            26
librarian         22
entertainment     16
marketing         16
artist            15
retired           13
lawyer            10
salesman           9
doctor             7
none               5
healthcare         5
homemaker          1
Name: count, dtype: int64